___Decision Tree Algorithm___

In [28]:
import pandas as pd
import numpy as np
from sklearn import tree
from sklearn import preprocessing
from sklearn.preprocessing import LabelEncoder

In [29]:
titanic_train=pd.read_csv('train.csv')

In [30]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
titanic_train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [32]:
titanic_train.drop(['Cabin','Name'],axis=1)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,female,35.0,1,0,113803,53.1000,S
4,5,0,3,male,35.0,0,0,373450,8.0500,S
...,...,...,...,...,...,...,...,...,...,...
884,887,0,2,male,27.0,0,0,211536,13.0000,S
885,888,1,1,female,19.0,0,0,112053,30.0000,S
886,889,0,3,female,45.0,1,2,W./C. 6607,23.4500,S
887,890,1,1,male,26.0,0,0,111369,30.0000,C
888,891,0,3,male,32.0,0,0,370376,7.7500,Q

We dropped Cabin because it had maximum nul values so rather than filling it we dropped it.
We dropped name as well beacuse we dont want categorical variable and name is big variable so we dropped it.

In [33]:
#Using label encoder,fit_transform we will convert sex,ticket and embarked in numeric variable
leb_enc=LabelEncoder()
titanic_train.Sex=leb_enc.fit_transform(titanic_train.Sex)
titanic_train.Ticket=leb_enc.fit_transform(titanic_train.Ticket)
titanic_train.Embarked=leb_enc.fit_transform(titanic_train.Embarked)

In [34]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,522,7.2500,NaN,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,595,71.2833,C85,0
2,3,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,668,7.9250,NaN,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,48,53.1000,C123,2
4,5,0,3,"Allen, Mr. William Henry",1,35.0,0,0,471,8.0500,NaN,2

In [35]:
tree_model=tree.DecisionTreeClassifier()

In [36]:
ABC=pd.DataFrame([titanic_train['Age'],titanic_train['Sex'],titanic_train['Fare']]).T

In [37]:
tree_model=tree.DecisionTreeClassifier(max_depth=8)

In [38]:
tree_model.fit(X=ABC,y=titanic_train['Survived'])

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=8, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [53]:
#creating dot file
with open('Project1Dtree.dot','w') as f:
     f=tree.export_graphviz(tree_model,feature_names=['Age','Sex','Fare'],out_file=f);

In [54]:
tree_model.score(X=ABC,y=titanic_train['Survived'])

0.8706411698537683

___Random Forest___

In [55]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [56]:
from sklearn.ensemble import RandomForestClassifier

In [57]:
rf_model=RandomForestClassifier(n_estimators=1000,max_features=2,oob_score=True)

In [58]:
features=['Age','Sex','Fare']

In [59]:
rf_model.fit(X=titanic_train[features],y=titanic_train['Survived'])

RandomForestClassifier(bootstrap=True, ccp_alpha=0.0, class_weight=None,
                       criterion='gini', max_depth=None, max_features=2,
                       max_leaf_nodes=None, max_samples=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=True, random_state=None,
                       verbose=0, warm_start=False)

In [60]:
print(rf_model.oob_score_)

0.7896512935883014

In [61]:
for features,imp in zip(features,rf_model.feature_importances_):
     print(features,imp)

Age 0.28742975949676747
Sex 0.2846702091941139
Fare 0.4279000313091186

Fare has maximum importance

___Prediction___

In [62]:
test_preds=tree_model.predict(X=ABC)

In [63]:
predicted_output=pd.DataFrame({'PassengerId':titanic_train['PassengerId'],'Survived':test_preds})

In [64]:
predicted_output.to_csv('Output.csv',index=False);

In [65]:
prediction=pd.read_csv('Output.csv')

In [66]:
print(prediction)

     PassengerId  Survived
0              1         0
1              2         1
2              3         1
3              4         1
4              5         0
..           ...       ...
884          887         0
885          888         0
886          889         1
887          890         1
888          891         0

[889 rows x 2 columns]